ka2_2024/src/Enums/МетодыНазначенияИВыплатыПособийСФР/МетодыНазначенияИВыплатыПособийСФР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>МетодыНазначенияИВыплатыПособийСФР</name>
  <enumValues>
    <name>ПоОдномуСтрахователю</name>
  </enumValues>
  <enumValues>
    <name>ПоОдномуСтрахователюПоТД</name>
  </enumValues>
  <enumValues>
    <name>ПоОдномуСтрахователюПоГПХ</name>
  </enumValues>
  <enumValues>
    <name>ПоОдномуСтрахователюПоТДИПоОдномуСтрахователюПоГПХ</name>
  </enumValues>
  <enumValues>
    <name>ПоНесколькимСтрахователям</name>
  </enumValues>
  <enumValues>
    <name>ПоНесколькимСтрахователямПоТД</name>
  </enumValues>
  <enumValues>
    <name>ПоНесколькимСтрахователямПоТДИПоОдномуСтрахователюПоГПХ</name>
  </enumValues>
</mdclass:Enum>

ka2_2024/src/Enums/МетодыНазначенияИВыплатыПособийСФР/ManagerModule.bsl
Функция СтрокаXML(Значение) Экспорт
	Если Значение = ПоОдномуСтрахователю Тогда
		Возврат "oneInsurerAssignment";
	
	ИначеЕсли Значение = ПоОдномуСтрахователюПоТД Тогда
		Возврат "oneTDInsurerAssignment";
	
	ИначеЕсли Значение = ПоОдномуСтрахователюПоГПХ Тогда
		Возврат "oneGPHInsurerAssignment";
	
	ИначеЕсли Значение = ПоОдномуСтрахователюПоТДИПоОдномуСтрахователюПоГПХ Тогда
		Возврат "oneTDInsurerAssignment_And_oneGPHInsurerAssignment";
	
	ИначеЕсли Значение = ПоНесколькимСтрахователям Тогда
		Возврат "severalInsurersAssignment";
	
	ИначеЕсли Значение = ПоНесколькимСтрахователямПоТД Тогда
		Возврат "severalTDInsurersAssignment";
	
	ИначеЕсли Значение = ПоНесколькимСтрахователямПоТДИПоОдномуСтрахователюПоГПХ Тогда
		Возврат "severalTDInsurersAssignment_And_oneGPHInsurerAssignment";
	
	Иначе
		Возврат "";
	КонецЕсли;
КонецФункции

Функция ЗначениеИзXML(СтрокаXML) Экспорт
	Если СтрСравнить(СтрокаXML, "oneInsurerAssignment") = 0 Тогда
		Возврат ПоОдномуСтрахователю;
	
	ИначеЕсли СтрСравнить(СтрокаXML, "oneTDInsurerAssignment") = 0 Тогда
		Возврат ПоОдномуСтрахователюПоТД;
	
	ИначеЕсли СтрСравнить(СтрокаXML, "oneGPHInsurerAssignment") = 0 Тогда
		Возврат ПоОдномуСтрахователюПоГПХ;
	
	ИначеЕсли СтрСравнить(СтрокаXML, "oneTDInsurerAssignment_And_oneGPHInsurerAssignment") = 0 Тогда
		Возврат ПоОдномуСтрахователюПоТДИПоОдномуСтрахователюПоГПХ;
	
	ИначеЕсли СтрСравнить(СтрокаXML, "severalInsurersAssignment") = 0 Тогда
		Возврат ПоНесколькимСтрахователям;
	
	ИначеЕсли СтрСравнить(СтрокаXML, "severalTDInsurersAssignment") = 0 Тогда
		Возврат ПоНесколькимСтрахователямПоТД;
	
	ИначеЕсли СтрСравнить(СтрокаXML, "severalTDInsurersAssignment_And_oneGPHInsurerAssignment") = 0 Тогда
		Возврат ПоНесколькимСтрахователямПоТДИПоОдномуСтрахователюПоГПХ;
	
	Иначе
		Возврат ПустаяСсылка();
	КонецЕсли;
КонецФункции
